davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
  //init peripheral (not turbo mode, poll every 250ms, if touch sample at 40Hz until no touch)
  if (setup_iqs263() == HAL_ERROR) {
	  strncpy(errorCondition, "ERR:IQS263ST", sizeof(errorCondition));
	  GlobalState.programMode = MODE_ERROR;
  }

    /* Infinite loop */
    for(;;)
    {

	 current_minute = iqs263_get_min_if_pressed(); //returns -1 if no press
     if (current_minute != -1) { //touch!

       if (!touch_end_count){ //START TOUCH EVENT!

    	   touch_end_count = 1;

    	   er_oled_clear(oled_buf);

    	   switch (GlobalState.programMode) {
    	   	   case MODE_ESM_TIME_ESTIMATE:
    	   	       xTaskNotifyGive(esmMainHandle);
           		   er_oled_string(0, 0, " GUESS TIME:", 12, 1, oled_buf);
           		   break;
    	   	   case MODE_ESM_SURVEY:
    	   	       er_oled_string(0, 0, GlobalState.surveyState.screenText, 12, 1, oled_buf);
    	   	       break;
    	   	   case MODE_RESTING:
    			   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    			   GlobalState.programMode = MODE_TIME_ESTIMATE;
    			   osMutexRelease(modeMutexHandle);
    			   //fall through to next case
    	   	   case MODE_TIME_ESTIMATE:
    	   		   er_oled_string(0, 0, " GUESS TIME:", 12, 1, oled_buf);
          		   break;
    	   }

           //if we're guessing the time, on start of touch we need to grab
           //the hour of the last seen time as a starting point.
           if (GlobalState.programMode == MODE_TIME_ESTIMATE ||
               GlobalState.programMode == MODE_ESM_TIME_ESTIMATE){

                osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
                cTime = GlobalState.lastSeenTime.time;
                osMutexRelease(lastSeenMutexHandle);

                hrs = RTC_Bcd2ToByte(cTime.Hours);
                mins = 0x00;
           }
       }


  	   if (last_minute != current_minute) { //UPDATE TOUCH VALUE!
  		   //update touch stuff!

           switch (GlobalState.programMode){
                case MODE_ESM_SURVEY:
                    //clear bottom
                    er_oled_clear_bottom_third(oled_buf);

                    //divide 10-50 min into option steps roughly
                    step = 50 / (GlobalState.surveyState.optionArrayLength+1);
                    for (i=0; i<GlobalState.surveyState.optionArrayLength; i++){
                        //map minute to option
                        if(current_minute > (11 + i*step) &&
                           current_minute < (11 + (i+1)*step)){
                            er_oled_string(0, 28, GlobalState.surveyState.optionArray[GlobalState.surveyState.optionArrayLength-1-i], 12, 1, oled_buf);
                        }
                    }
                    er_oled_display(oled_buf);

                    break;
                case MODE_TIME_ESTIMATE:
                case MODE_ESM_TIME_ESTIMATE:

                    //hours wrap
                    if (current_minute < 15 &&
                        current_minute >= 0 &&
                        last_minute > 45){
                        hrs = (hrs+1)%24;

                    } else if (current_minute > 45 &&
                               last_minute < 15){
                        if (hrs==0) {hrs = 23;}
                        else {hrs -= 1;}
                    }

                    //display time on bottom two thirds
                    sprintf (time, "%02d%02d", hrs, current_minute);
                    er_oled_time_twothird(time, oled_buf);

                    break;
           }

  		   last_minute = current_minute;

  	   }


  	   //optional
  	   osDelay(25);


     } else if (touch_end_count > 0){

  	   touch_end_count += 1;//increment touching_end_count

  	   if (touch_end_count >= TOUCH_END_TIMEOUT){  //FINISHED/CONFIRMED TOUCH VALUE!
  		   uint8_t option = 0xFF;

  		   switch (GlobalState.programMode){
  		   	   case MODE_ESM_SURVEY:
  		   		   //grab current option
  		   		   for (i=0; i<GlobalState.surveyState.optionArrayLength; i++){
  		   		     //map minute to option
  		   		     if(last_minute > (11 + i*step) &&
  		   		        last_minute < (11 + (i+1)*step)){
  		   		         option = GlobalState.surveyState.optionArrayLength-1-i;
  		   		     }
  		   		   }

  		   		   //send to ble
  		   		   bleSendData.sendType = TX_SURVEY_RESULT;
  		   		   bleSendData.data = (GlobalState.surveyState.surveyID << 8) | option;
  		   		   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

  		   		   //notify main thread
  		   		   xTaskNotifyGive(esmMainHandle);
  		   		   break;

  		   	   case MODE_ESM_TIME_ESTIMATE:
  		   		   //send to ble
  		   		   bleSendData.sendType = TX_TIME_EST;
  		   		   bleSendData.data = (hrs << 8) | last_minute;
   		   		   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

   		   		   //notify main thread
   		   		   xTaskNotifyGive(esmMainHandle);
  		   		   break;

  		   	   case MODE_TIME_ESTIMATE:
  		   		   //send to ble
  		   		   bleSendData.sendType = TX_TIME_EST;
  		   		   bleSendData.data = (hrs << 8) | last_minute;
   		   		   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

   		   		   //not from main thread, show time (which updates seen time, new interval, back to rest)
  		   		   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				   GlobalState.programMode = MODE_SHOW_TIME;
				   osMutexRelease(modeMutexHandle);
				   break;
  		   }

  		   touch_end_count = 0;
  		   last_minute = -1;
  		   er_oled_clear(oled_buf);
  		   er_oled_display(oled_buf);

  	   }

  	   osDelay(25);


     }else { //no touch, wait for a touch

       switch (GlobalState.programMode){
        case MODE_CANCEL:
    	   //had a 'cancel' button event

    	   er_oled_clear(oled_buf);
   	   	   er_oled_string(0, 0, "  dismiss!", 12, 1, oled_buf);
   	   	   er_oled_string(0, 20, "TIME NOW IS:", 12, 1, oled_buf);
   	   	   er_oled_display(oled_buf);

   	   	   osDelay(1000);

   	   	   osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
   	   	   HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
   	   	   HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
   	   	   osMutexRelease(rtcMutexHandle);

   	   	   hrs = RTC_Bcd2ToByte(cTime.Hours);
   	   	   mins = RTC_Bcd2ToByte(cTime.Minutes);
   	   	   sprintf (time, "%02d%02d", hrs, mins);
   	   	   er_oled_time(time);

	       osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
	       GlobalState.lastSeenTime.time = cTime;
	       GlobalState.lastSeenTime.date = cDate;
	       osMutexRelease(lastSeenMutexHandle);

	       bleSendData.sendType = TX_TIME_SEEN;
	       bleSendData.data = 0x0000;
	       osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

	       updateInterval();

	       osMutexAcquire(modeMutexHandle, portMAX_DELAY);
	       GlobalState.programMode = MODE_RESTING;
	       osMutexRelease(modeMutexHandle);

	       osDelay(3000);
	       er_oled_clear(oled_buf);
	       er_oled_display(oled_buf);
	       break;

        case MODE_SHOW_TIME:
		   //show time, no cancel, but does the same thing

		   er_oled_clear(oled_buf);
		   er_oled_string(0, 0, " completed", 12, 1, oled_buf);
		   er_oled_string(0, 20, "TIME NOW IS:", 12, 1, oled_buf);
		   er_oled_display(oled_buf);

		   osDelay(1000);

		   osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
		   HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
		   HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
		   osMutexRelease(rtcMutexHandle);

		   hrs = RTC_Bcd2ToByte(cTime.Hours);
		   mins = RTC_Bcd2ToByte(cTime.Minutes);
		   sprintf (time, "%02d%02d", hrs, mins);
		   er_oled_time(time);

		   osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
		   GlobalState.lastSeenTime.time = cTime;
		   GlobalState.lastSeenTime.date = cDate;
		   osMutexRelease(lastSeenMutexHandle);

		   bleSendData.sendType = TX_TIME_SEEN;
		   bleSendData.data = 0x0000;
		   osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

		   updateInterval();

		   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		   GlobalState.programMode = MODE_RESTING;
		   osMutexRelease(modeMutexHandle);

		   osDelay(3000);
		   er_oled_clear(oled_buf);
		   er_oled_display(oled_buf);
		   break;

       case MODE_ERROR:
    	   //ERROR condition: print condition and loop forever

    	   er_oled_clear(oled_buf);
    	   er_oled_string(0, 12, errorCondition, 12, 1, oled_buf);
    	   er_oled_display(oled_buf);
    	   for (;;){}
    	   break;

       case MODE_CLEAR:
    	   //Timeout, notify and wait until clear
    	   //show time and restart

		   er_oled_clear(oled_buf);
		   er_oled_string(0, 10, "  TIMEOUT!", 12, 1, oled_buf);
		   er_oled_string(0, 28, " hit button", 12, 1, oled_buf);
		   er_oled_display(oled_buf);

		   osDelay(500);
    	   break;

       case MODE_ESM_TIME_ESTIMATE:
    	  er_oled_clear(oled_buf);
    	  er_oled_string(0, 0, " GUESS TIME:", 12, 1, oled_buf);
    	  er_oled_display(oled_buf);
    	  osDelay(100);
    	  break;

       case MODE_ESM_SURVEY:
    	  er_oled_clear(oled_buf);
    	  er_oled_string(0, 0, GlobalState.surveyState.screenText, 12, 1, oled_buf);
    	  er_oled_display(oled_buf);
    	  osDelay(100);
    	  break;

       case MODE_RESTING:
		   osDelay(250);
		   break;

       default:
    	   osDelay(20);
    	   break;
       }

