davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
     }
    }



  /* USER CODE END startUIControl */
}

/* USER CODE BEGIN Header_startESMMain */
/**
* @brief Function implementing the esmMain thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startESMMain */
void startESMMain(void *argument)
{
  /* USER CODE BEGIN startESMMain */


  const BLETX_Queue_t bleSendInit = {TX_SURVEY_INITIALIZED, 0x0000};

  uint32_t notification;

  RTC_TimeTypeDef cTime;
  RTC_DateTypeDef cDate;

  /* Infinite loop */
  for(;;)
  {

    osDelay(5000);

    //Grab current time
    osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
    HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
    HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
    osMutexRelease(rtcMutexHandle);

    uint8_t curr_hrs = RTC_Bcd2ToByte(cTime.Hours);
    uint8_t curr_min = RTC_Bcd2ToByte(cTime.Minutes);

    //Grab last time hrs/min
    uint8_t last_hrs = RTC_Bcd2ToByte(GlobalState.lastSeenTime.time.Hours);
    uint8_t last_min = RTC_Bcd2ToByte(GlobalState.lastSeenTime.time.Minutes);

    //TODO: here, write these conditions.  BLE_SEND with linked list if fail.
    // BLE_RX with update time, update bounds, pause.  App that stores data.
    // Make survey better.

    //Init Survey:
    // TIME BOUNDS for current time hrs
    // curr_time > last_time + interval  (wrapped, in next 3 hours)
    // programMode is RESTING
    // not GlobalState.paused
    if (GlobalState.programMode == MODE_RESTING && ){

    	//send TX_SURVEY_INITIALIZED
    	osMessageQueuePut(bleTXqueueHandle, &bleSendInit, 0, 0);

    	//set program mode to MODE_ESM_TIME_ESTIMATE
    	osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    	GlobalState.programMode = MODE_ESM_TIME_ESTIMATE;
    	osMutexRelease(modeMutexHandle);

    	//clear UI notification flags
    	xTaskNotifyStateClear(NULL);

    	uint8_t continue_flag = 1;

    	//(1) Alert Loop and ESM_TIME_ESTIMATE
    	uint8_t keep_alerting = 1;
    	while(keep_alerting){

    		//alert
    		xTaskNotifyGive(alertHandle);
    		//wait for notification from UI thread that indicates start of user interaction
    		notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(ALERT_TIMEOUT));
       	    if (notification){ //not a timeout, interaction started
        		keep_alerting = 0;
     		}
    	    if (GlobalState.programMode != MODE_ESM_TIME_ESTIMATE){
    	    	//button press has changed mode and canceled interaction. want to exit alert loop.
    	    	keep_alerting = 0;
    	    	continue_flag = 0;
    	    }
        }

    	//SECOND SCREEN FOR ESM
    	if (continue_flag){
    		//(2) Wait for notification from UI thread that indicates confirmed input
    		notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

    		if (GlobalState.programMode != MODE_ESM_TIME_ESTIMATE){
    			//if our mode has changed, we had a dismiss/snooze event
    			continue_flag = 0;
    		}
    	}

    	if (continue_flag){
    		if (notification){//not timed out, had a confirmed event
    			//set up next interaction
    			//set up survey
    			osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
    			strncpy(GlobalState.surveyState.screenText, "    FOCUS?", strlen("    FOCUS?") + 1);
    			GlobalState.surveyState.screenTextLength = strlen("    FOCUS?");
    			GlobalState.surveyState.surveyID = SURVEY_FOCUS;
    			//GlobalState.surveyState.optionArray = opts_five;
    			memcpy(GlobalState.surveyState.optionArray, opts_five, sizeof(opts_five));
    			GlobalState.surveyState.optionArrayLength = 5;
    			osMutexRelease(surveyMutexHandle);

    			//programMode
    			osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    			GlobalState.programMode = MODE_ESM_SURVEY;
    			osMutexRelease(modeMutexHandle);

    		} else {//timed out due to inactivity
    			continue_flag = 0;

    			osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    			GlobalState.programMode = MODE_CLEAR;
    			osMutexRelease(modeMutexHandle);
    		}
    	}

    	//THIRD SCREEN FOR ESM
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//set up next interaction
				//set up survey
				osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
				strncpy(GlobalState.surveyState.screenText, "  TIME CUE", strlen("  TIME CUE") + 1);
				GlobalState.surveyState.screenTextLength = strlen("  TIME CUE");
				GlobalState.surveyState.surveyID = SURVEY_TIMECUE;
				//&(GlobalState.surveyState.optionArray) = &opts_agree;
				memcpy(GlobalState.surveyState.optionArray, opts_agree, sizeof(opts_agree));
				GlobalState.surveyState.optionArrayLength = 2;
				osMutexRelease(surveyMutexHandle);

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}


		//FINISH ESM; SHOW TIME
		if (continue_flag){
			//(2) Wait for notification from UI thread that indicates confirmed input
			notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(INTERACTION_TIMEOUT));

			if (GlobalState.programMode != MODE_ESM_SURVEY){
				//if our mode has changed, we had a dismiss/snooze event
				continue_flag = 0;
			}
		}

		if (continue_flag){
			if (notification){//not timed out, had a confirmed event
				//completed survey with no problem!

				//back to rest, show time
				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_SHOW_TIME;
				osMutexRelease(modeMutexHandle);;

			} else {//timed out due to inactivity
				continue_flag = 0;

				osMutexAcquire(modeMutexHandle, portMAX_DELAY);
				GlobalState.programMode = MODE_CLEAR;
				osMutexRelease(modeMutexHandle);
			}
		}

