davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
  	for (;;){

  		lux = veml_Get_Lux();
    	whiteLux = veml_Get_White_Lux();
    	temperature = si7021_measure_temperature(&hi2c1);
    	humidity = si7021_measure_humidity(&hi2c1);

    	osMutexAcquire(conditionMutexHandle, portMAX_DELAY);
    	GlobalState.lastConditions.lux = lux;
    	GlobalState.lastConditions.whiteLux = whiteLux;
    	GlobalState.lastConditions.temp = temperature;
    	GlobalState.lastConditions.humd = humidity;
    	osMutexRelease(conditionMutexHandle);

		osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

    	osDelay(9900);
  	}

/* USER CODE END startConditionsPoll */
}


/* USER CODE BEGIN Header_startBLETX */
/**
* @brief Function implementing the bleTX thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startBLETX */
void startBLETX(void *argument)
{
  /* USER CODE BEGIN startBLETX */
  BLETX_Queue_t sendData;

  /* Infinite loop */
  for(;;)
  {
    if (osMessageQueueGet(bleTXqueueHandle, &sendData, NULL, osWaitForever) == osOK){

    	//TX_TIME_SEEN - data in GlobalState.lastSeenTime

    	//TX_TEMP_HUMD - construct both TX_TEMP_HUMD/TX_LUX_WHITELUX
    	//               with data in GlobalState.lastConditions

    	//TX_LAST_SURVEY_INVALID -- just send that timestamped

    	//TX_SURVEY_INITIALIZED -- just send that timestamped

    	//TX_TIME_EST - use data in sendData, first byte is hr second byte is min
    	//TX_TIMESTAMP_UPDATE -- use data in sendData for error, to send
    	//TX_SURVEY_RESULT -- use data in sendData, first byte is survey/second is answer

    	P2PS_Send_Data(sendData.data);
    }
  }
  /* USER CODE END startBLETX */
}

/* USER CODE BEGIN Header_startBLERX */
/**
* @brief Function implementing the bleRX thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startBLERX */
void startBLERX(void *argument)
{
  /* USER CODE BEGIN startBLERX */
  /* Infinite loop */

  P2PS_STM_Data_t rxData;

  for(;;)
  {

	if (osMessageQueueGet(bleRXqueueHandle, &rxData, NULL, osWaitForever) == osOK){

		if (rxData.pPayload[0] == 0x00) { // timestamp update starts with 0x00
			memcpy(&P2P_Server_App_Context.OTATimestamp, &(rxData.pPayload[1]), 8);
    	    P2P_Server_App_Context.OTA12HrFormat = rxData.pPayload[9];
    		P2P_Server_App_Context.OTADaylightSavings = rxData.pPayload[10];

    	    RTC_TimeTypeDef sTime = {0};
    		RTC_DateTypeDef sDate = {0};

    		uint8_t timestampvals[8];
    		memcpy(timestampvals, &(P2P_Server_App_Context.OTATimestamp), 8);

    		uint8_t AMPM = timestampvals[0];

    		sTime.Hours      = timestampvals[4];
    		sTime.Minutes    = timestampvals[5];
    		sTime.Seconds    = timestampvals[6];
    		sTime.SubSeconds = 0x0;
    		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;

    		if (P2P_Server_App_Context.OTADaylightSavings){ sTime.DayLightSaving = RTC_DAYLIGHTSAVING_ADD1H; }

    		sTime.StoreOperation = RTC_STOREOPERATION_RESET;

    		sDate.WeekDay = timestampvals[0];
    		sDate.Month   = timestampvals[1];
    		sDate.Date    = timestampvals[2];
    		sDate.Year    = timestampvals[3];

    		osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
    		if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK) {Error_Handler();}
    		if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK) {Error_Handler();}
    	    osMutexRelease(rtcMutexHandle);

		}


/*		else if (rxData.pPayload[0] == 0x06) {//screen text update starts with 0x06

			//works great if string sent is <=18 and has a '00' byte (19 + update byte, 20 byte MTU)
			//'00' obviously connotes the end of the string.
			//should edit this to have a char buffer in place (128 byte) that copies over
			// rxData.pPayload[1] for rxData.Length - 1, check last byte.  if 00 stop,
			//otherwise wait and keep filling buffer with next packet.
			//write a complementary send function that adds a hex '00' and chops the full string
			//into 19 byte chunks when sending with 0x01 header from phone.
			strncpy(&(textbuffer[continuing*19]), &(rxData.pPayload[1]), rxData.Length - 1);
			continuing += 1;

			if (rxData.pPayload[rxData.Length-1] == 0x00) { //completed string

				osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
				strncpy(ScreenState.screenText, textbuffer, 128);
				osMutexRelease(screenTextMutexHandle);
				xTaskNotify(screenUpdateHandle, (uint32_t)SCREEN_TEXT, eSetValueWithOverwrite);

				continuing = 0;

			}

			//osMutexAcquire(screenTextMutexHandle, portMAX_DELAY);
			//strncpy(ScreenState.screenText, &(rxData.pPayload[1]), rxData.Length - 1);
			//osMutexRelease(screenTextMutexHandle);
			//xTaskNotify(screenUpdateHandle, (uint32_t)SCREEN_TEXT, eSetValueWithOverwrite);

		} else if (rxData.pPayload[0] == 0x03) { //vibrate payload with duration to vibrate starts with 0x03

			//uint8_t duration[4] = {0};
	    	//memcpy(&(duration[4-(rxData.Length-1)]), &(rxData.pPayload[1]), rxData.Length-1);
	    	//uint32_t send_duration = duration[0] << 24 | duration[1] << 16 | duration[2] << 8 | duration[3];

	    	uint32_t send_duration = 0;
	    	for (uint8_t i=0; i<rxData.Length-1; i++){
	    		send_duration |= rxData.pPayload[1+i] << ((rxData.Length-2-i)*8);
	    	}

	    	xTaskNotify(vibrateControlHandle, send_duration, eSetValueWithOverwrite);
	    } else if (rxData.pPayload[0] == 0x07) { //led state update
	    	osMutexAcquire(ledStateMutexHandle, portMAX_DELAY);
	    	LedState.currentMode = rxData.pPayload[1];
	    	osMutexRelease(ledStateMutexHandle);
	    }*/
	}
  }
  /* USER CODE END startBLERX */
}


void PeriphClock_Config(void)
{
  #if (CFG_USB_INTERFACE_ENABLE != 0)
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };
	RCC_CRSInitTypeDef RCC_CRSInitStruct = { 0 };

	/**
   * This prevents the CPU2 to disable the HSI48 oscillator when
   * it does not use anymore the RNG IP
   */
  LL_HSEM_1StepLock( HSEM, 5 );

  LL_RCC_HSI48_Enable();

	while(!LL_RCC_HSI48_IsReady());

